Merge pull request #146 from jmelis/testing-strategy-iteration
iterate on the testing strategy
